app/views/favorites/_favorite.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
 <%= link_to book_favorites_path(book), method: :delete do %>
 <div id = "color"><i class="fas fa-heart"></i><%= book.favorites.count %></div>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
 <%= link_to book_favorites_path(book), method: :post do %>
 <i class="fas fa-heart"></i><%= book.favorites.count %>