app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2021-11-03 12:03:02.298289"], ["updated_at", "2021-11-03 12:03:02.298289"]]
---
  def create
   @book = Book.find(params[:book_id])
   favorite = @book.favorites.new(user_id: current_user.id)
   favorite.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["book_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def destroy
   @book = Book.find(params[:book_id])
   favorite = @book.favorites.find_by(user_id: current_user.id)
   favorite.destroy